Backend/blogger/app/controllers/blogzs_controller.rb

SELECT "blogzs".* FROM "blogzs"
---
  def index
    @blogzs = Blogz.all

INSERT INTO "blogzs" ("title", "content", "author", "img", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "TEST"], ["content", "TEST"], ["author", "TEST"], ["img", ""], ["created_at", "2021-01-21 02:26:54.865785"], ["updated_at", "2021-01-21 02:26:54.865785"]]
---
  def create
    @blogz = Blogz.new(blogz_params)

    if @blogz.save

SELECT "blogzs".* FROM "blogzs" WHERE "blogzs"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_blogz
      @blogz = Blogz.find(params[:id])