Backend/blogger/app/controllers/comments_controller.rb

INSERT INTO "comments" ("name", "email", "ideas", "created_at", "updated_at", "blogz_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Test"], ["email", "test@test.com"], ["ideas", "test"], ["created_at", "2021-01-22 14:54:59.861975"], ["updated_at", "2021-01-22 14:54:59.861975"], ["blogz_id", 1]]
---
  def create
    @comment = Comment.new(comment_params)

    @comment.blogz_id = params[:blogz_id]
    if @comment.save